11/data/attachments/954884ae97925caa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cccdb5a6-ee86-4345-91c9-d1cf209bb9ab</nif:username>
            <nif:friendToBeAdded>Molly_perhaps_Friend_4563_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>